LTG2012/xiaozhi-esp32-echoear/main/boards/esp-vocat/esp_vocat.cc
          server.AddTool(
              "self.wallpaper.update_weather",
            "After the weather service has returned a result, update the cached Emote wallpaper weather. "
            "Do not call a weather service from the device; pass the service result to this tool.",
            PropertyList({Property("city", kPropertyTypeString),
                          Property("condition", kPropertyTypeString),
                          Property("temperature_c", kPropertyTypeInteger, -100, 100),
                          Property("high_c", kPropertyTypeInteger, -1000),
                          Property("low_c", kPropertyTypeInteger, -1000)}),
            [this](const PropertyList& properties) -> ReturnValue {
                auto* display = dynamic_cast<emote::EmoteDisplay*>(display_);
                if (!display) {
                    return std::string("Wallpaper desktop is only available in the Emote firmware.");
                }
                const std::string city = properties["city"].value<std::string>();
                const std::string condition = properties["condition"].value<std::string>();
                if (city.empty() || condition.empty()) {
                    return std::string("City and condition are required.");
                }
                display->SetWallpaperWeather(city.c_str(), condition.c_str(),
                                             properties["temperature_c"].value<int>(),
                                             properties["high_c"].value<int>(),
                                             properties["low_c"].value<int>());
                  return std::string("Wallpaper weather updated: ") + city + " " + condition;
              });

          server.AddTool(
              "self.wallpaper.refresh",
              "Rescan /wallpapers on the SD card for JPEG custom wallpapers. Call this when the user asks to refresh or reload wallpaper files.",
              PropertyList(),
              [this](const PropertyList&) -> ReturnValue {
                  auto* display = dynamic_cast<emote::EmoteDisplay*>(display_);
                  if (!display) {
                      return std::string("Wallpaper desktop is only available in the Emote firmware.");
                  }
                  return display->RefreshCustomWallpapers();
              });
      }

    void RegisterMediaTransferMcpTools()
    {
        auto& server = McpServer::GetInstance();
        server.AddTool(
            "self.media_transfer.start",
            "Open the Emote device's local Wi-Fi wallpaper management page for 10 minutes. Call when the user asks to upload or manage SD-card wallpapers. The device displays the QR code and IP address for a phone or computer browser.",
            PropertyList(), [this](const PropertyList&) -> ReturnValue { return media_transfer_->Start(); });
        server.AddTool(
            "self.media_transfer.stop", "Close the local Wi-Fi media transfer page.",
            PropertyList(), [this](const PropertyList&) -> ReturnValue { return media_transfer_->Stop(); });
        server.AddTool(
            "self.media_transfer.status", "Get the local Wi-Fi media transfer status.",
            PropertyList(), [this](const PropertyList&) -> ReturnValue { return media_transfer_->Status(); });
    }

    void HandleTouchRelease()
    {
        constexpr int64_t kTransitionWindowUs = 450 * 1000;
        if (two_pad_touch_mode_ && touch_release_pending_ &&
            esp_timer_get_time() - touch_release_time_us_ > kTransitionWindowUs) {
            ShowTouchFeedback(touch_swipe_detected_ ? "shocked" : "happy");
            touch_swipe_detected_ = false;
            touch_release_pending_ = false;
            touch_start_channel_ = 0;
        }
    }

    static void touch_cap_poll_task(void* arg)
    {
        auto* self = static_cast<EspVocat*>(arg);
        while (true) {
            if (self != nullptr && self->touch_button_handle_ != nullptr) {
                touch_button_sensor_handle_events(self->touch_button_handle_);
                self->HandleTouchRelease();
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }
    }

    void InitializeCapacitiveTouchPads()
    {
        if (TOUCH_PAD1 == GPIO_NUM_NC) {
            ESP_LOGW(TAG, "Capacitive touch disabled: TOUCH_PAD1 NC");
            return;
        }

        const uint32_t ch1 = TouchChannelFromPadGpio(TOUCH_PAD1);
        if (ch1 == 0) {
            ESP_LOGW(TAG, "TOUCH_PAD1 GPIO %d is not a touch channel (expect GPIO1..GPIO14)", (int)TOUCH_PAD1);
            return;
        }

        if (TOUCH_PAD2 != GPIO_NUM_NC) {
            const uint32_t ch2 = TouchChannelFromPadGpio(TOUCH_PAD2);
            if (ch2 == 0) {
                ESP_LOGW(TAG, "TOUCH_PAD2 GPIO %d is not a touch channel", (int)TOUCH_PAD2);
                return;
            }

            static uint32_t btn_ch[2];
            static float btn_thr[2];
            btn_ch[0] = ch1;
            btn_ch[1] = ch2;
            btn_thr[0] = 0.012f;
            btn_thr[1] = 0.012f;

            touch_button_config_t btn_cfg = {
                .channel_num = 2,
                .channel_list = btn_ch,
                .channel_threshold = btn_thr,
                .channel_gold_value = nullptr,
                .debounce_times = 3,
                .skip_lowlevel_init = false,
            };
            esp_err_t err = touch_button_sensor_create(&btn_cfg, &touch_button_handle_, touch_button_event_callback, this);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "touch_button_sensor_create failed: %s", esp_err_to_name(err));
                touch_button_handle_ = nullptr;
                return;
            }
            two_pad_touch_mode_ = true;
            touch_pad1_channel_ = ch1;
            touch_pad2_channel_ = ch2;
            xTaskCreatePinnedToCore(touch_cap_poll_task, "touch_cap", 3072, this, 3, &touch_slider_task_handle_, 1);
            ESP_LOGI(TAG, "Touch pads (PCB v1.2+): PAD1 GPIO%d ch%u, PAD2 GPIO%d ch%u",
                     (int)TOUCH_PAD1, (unsigned)btn_ch[0], (int)TOUCH_PAD2, (unsigned)btn_ch[1]);
            return;
        }

        static uint32_t btn_ch[1];
        static float btn_thr[1];
        btn_ch[0] = ch1;
        btn_thr[0] = 0.004f;

